app/controllers/students_controller.rb

  def show
    @student=Student.all.find(params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]